; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v4 ?v5)
             (pred_7 ?v11 ?v13)
             (pred_9 ?v4 ?v13)
             (pred_11 ?v3 ?v4 )
	     (pred_12 ?v4)
             (pred_2 ?v8)
             (pred_10 ?v11)
             (pred_5 ?v13)
             (pred_1 ?v4)
             (pred_8 ?v11)
             (pred_6 ?v4)
             (pred_4 ))



(:action op_2
:parameters (?v1 ?v10 ?v9 ?v7)
:precondition (and (pred_2 ?v1) (pred_2 ?v10) (pred_10 ?v9) (pred_5 ?v7)
          (pred_3 ?v1 ?v10) (pred_7 ?v9 ?v7)
                   (pred_9 ?v10 ?v7) (pred_12 ?v1) 
                   (pred_1 ?v10) (pred_8 ?v9))
:effect (and  (pred_6 ?v10) (not (pred_1 ?v10))))


(:action op_1
:parameters (?v1 ?v12)
:precondition (and (pred_2 ?v1) (pred_2 ?v12)
               (pred_12 ?v1) (pred_3 ?v1 ?v12) (pred_6 ?v12))
:effect (and (pred_12 ?v12) (not (pred_12 ?v1))))

(:action op_4
:parameters (?v1 ?v9)
:precondition (and (pred_2 ?v1) (pred_10 ?v9) 
                  (pred_12 ?v1) (pred_11 ?v9 ?v1) (pred_4 ))
:effect (and (pred_8 ?v9)
   (not (pred_11 ?v9 ?v1)) (not (pred_4 ))))


(:action op_5
:parameters (?v1 ?v2 ?v6)
:precondition (and (pred_2 ?v1) (pred_10 ?v2) (pred_10 ?v6)
                  (pred_12 ?v1) (pred_8 ?v6) (pred_11 ?v2 ?v1))
:effect (and (pred_8 ?v2) (pred_11 ?v6 ?v1)
        (not (pred_8 ?v6)) (not (pred_11 ?v2 ?v1))))

(:action op_3
:parameters (?v1 ?v9)
:precondition (and (pred_2 ?v1) (pred_10 ?v9) 
                  (pred_12 ?v1) (pred_8 ?v9))
:effect (and (pred_4 ) (pred_11 ?v9 ?v1) (not (pred_8 ?v9)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_18 obj_04 obj_22 obj_15 obj_02 obj_03 obj_21 obj_08 obj_16 obj_20 obj_11 obj_09 obj_01 obj_12 obj_07
    obj_06 obj_17 obj_14
    obj_10 obj_13 obj_05
    )

    (:init
       (pred_4)

       (pred_2 obj_19)
       (pred_2 obj_18)
       (pred_2 obj_04)
       (pred_2 obj_22)
       (pred_2 obj_15)
       (pred_2 obj_02)
       (pred_2 obj_03)
       (pred_2 obj_21)
       (pred_2 obj_08)
       (pred_2 obj_16)
       (pred_2 obj_20)
       (pred_2 obj_11)
       (pred_2 obj_09)
       (pred_2 obj_01)
       (pred_2 obj_12)
       (pred_2 obj_07)
       (pred_5 obj_06)
       (pred_5 obj_17)
       (pred_5 obj_14)
       (pred_10 obj_10)
       (pred_10 obj_13)
       (pred_10 obj_05)

       (pred_3 obj_19 obj_15)
       (pred_3 obj_19 obj_18)
       (pred_3 obj_18 obj_02)
       (pred_3 obj_18 obj_04)
       (pred_3 obj_18 obj_19)
       (pred_3 obj_04 obj_03)
       (pred_3 obj_04 obj_22)
       (pred_3 obj_04 obj_18)
       (pred_3 obj_22 obj_21)
       (pred_3 obj_22 obj_04)
       (pred_3 obj_15 obj_08)
       (pred_3 obj_15 obj_02)
       (pred_3 obj_15 obj_19)
       (pred_3 obj_02 obj_16)
       (pred_3 obj_02 obj_03)
       (pred_3 obj_02 obj_18)
       (pred_3 obj_02 obj_15)
       (pred_3 obj_03 obj_20)
       (pred_3 obj_03 obj_21)
       (pred_3 obj_03 obj_04)
       (pred_3 obj_03 obj_02)
       (pred_3 obj_21 obj_11)
       (pred_3 obj_21 obj_22)
       (pred_3 obj_21 obj_03)
       (pred_3 obj_08 obj_09)
       (pred_3 obj_08 obj_16)
       (pred_3 obj_08 obj_15)
       (pred_3 obj_16 obj_01)
       (pred_3 obj_16 obj_20)
       (pred_3 obj_16 obj_02)
       (pred_3 obj_16 obj_08)
       (pred_3 obj_20 obj_12)
       (pred_3 obj_20 obj_11)
       (pred_3 obj_20 obj_03)
       (pred_3 obj_20 obj_16)
       (pred_3 obj_11 obj_07)
       (pred_3 obj_11 obj_21)
       (pred_3 obj_11 obj_20)
       (pred_3 obj_09 obj_01)
       (pred_3 obj_09 obj_08)
       (pred_3 obj_01 obj_12)
       (pred_3 obj_01 obj_16)
       (pred_3 obj_01 obj_09)
       (pred_3 obj_12 obj_07)
       (pred_3 obj_12 obj_20)
       (pred_3 obj_12 obj_01)
       (pred_3 obj_07 obj_11)
       (pred_3 obj_07 obj_12)
       (pred_1 obj_12)
       (pred_1 obj_04)
       (pred_1 obj_21)
       (pred_9  obj_12 obj_06)
       (pred_9  obj_04 obj_17)
       (pred_9  obj_21 obj_14)
       (pred_6 obj_19)
       (pred_6 obj_18)
       (pred_6 obj_22)
       (pred_6 obj_15)
       (pred_6 obj_02)
       (pred_6 obj_03)
       (pred_6 obj_08)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_6 obj_11)
       (pred_6 obj_09)
       (pred_6 obj_01)
       (pred_6 obj_07)

       (pred_7  obj_10 obj_06)
       (pred_7  obj_13 obj_17)
       (pred_7  obj_05 obj_14)
       (pred_11 obj_10 obj_19)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_05 obj_15)
       (pred_12 obj_11)
    )

    (:goal (and
       (pred_11 obj_10 obj_03)
       (pred_11 obj_05 obj_16)
    ))
(:constraints
  (always (not (pred_12 obj_02)))
)
)

; plan
1. (op_1 obj_11 obj_20)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_20)
   goals met: 0 of 2
2. (op_1 obj_20 obj_16)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_16)
   goals met: 0 of 2
3. (op_1 obj_16 obj_08)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_08)
   goals met: 0 of 2
4. (op_1 obj_08 obj_15)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_15)
   goals met: 0 of 2
5. (op_1 obj_15 obj_19)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_19)
   goals met: 0 of 2
6. (op_4 obj_19 obj_10)
   deleted: (pred_11 obj_10 obj_19) (pred_4)
   added: (pred_8 obj_10)
   goals met: 0 of 2
7. (op_1 obj_19 obj_15)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_15)
   goals met: 0 of 2
8. (op_5 obj_15 obj_05 obj_10)
   deleted: (pred_8 obj_10) (pred_11 obj_05 obj_15)
   added: (pred_8 obj_05) (pred_11 obj_10 obj_15)
   goals met: 0 of 2
9. (op_1 obj_15 obj_08)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_08)
   goals met: 0 of 2
10. (op_1 obj_08 obj_16)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_16)
   goals met: 0 of 2
11. (op_3 obj_16 obj_05)
   deleted: (pred_8 obj_05)
   added: (pred_4) (pred_11 obj_05 obj_16)
   goals met: 1 of 2
12. (op_1 obj_16 obj_08)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_08)
   goals met: 1 of 2
13. (op_1 obj_08 obj_15)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_15)
   goals met: 1 of 2
14. (op_4 obj_15 obj_10)
   deleted: (pred_11 obj_10 obj_15) (pred_4)
   added: (pred_8 obj_10)
   goals met: 1 of 2
15. (op_1 obj_15 obj_08)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_08)
   goals met: 1 of 2
16. (op_1 obj_08 obj_16)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_16)
   goals met: 1 of 2
17. (op_1 obj_16 obj_20)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_20)
   goals met: 1 of 2
18. (op_1 obj_20 obj_03)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_03)
   goals met: 1 of 2
19. (op_3 obj_03 obj_10)
   deleted: (pred_8 obj_10)
   added: (pred_4) (pred_11 obj_10 obj_03)
   goals met: 2 of 2
